/*------------------------------------------------------------------------------
 *上海宇志通信技术有限公司  www.caspl.cn
 *------------------------------------------------------------------------------
 *FPGA地址映射文件
 *------------------------------------------------------------------------------*/

#define    		FPGA_WRITE_CS     						0x0a0040000//CE2  
#define    		FPGA_READ_CS      						0x0a0080000//CE2  

/**********************************************
*系统段基址分配
***********************************************/
#define         SYSTEM_LEVEL                            0x0000//系统级基址
#define			UART_CHANNEL							0x1000//UART通道基址
/**********************************************
*通道段基址分配
***********************************************/
#define         CHANNEL_SYS                             0x0000//系统级通道基址
#define         CHANNEL_1                               0x0100//通道1基址
#define         CHANNEL_2                               0x0200//通道2基址
#define         CHANNEL_3                               0x0300//通道3基址
#define         CHANNEL_4                               0x0400//通道4基址
#define         CHANNEL_5                               0x0500//通道5基址
#define         CHANNEL_6                               0x0600//通道6基址
#define         CHANNEL_7                               0x0700//通道7基址
#define         CHANNEL_8                               0x0800//通道8基址
#define         CHANNEL_9                               0x0900//通道9基址
#define         CHANNEL_10                              0x0A00//通道10基址
#define         CHANNEL_11                              0x0B00//通道11基址
#define         CHANNEL_12                              0x0C00//通道12基址

/***********************************************
*名称：系统级寄存器地址分配
*功能：具体分配每个寄存器的地址
***********************************************/
#define         ADDR_PROG_INT							0x0000
#define			ADDR_INT_VALID_STATUS					0x0001
#define			ADDR_INT_STATUS_CLEAR					0x0002

/***********************************************
*名称：串口通道寄存器地址分配
*功能：具体分配每个寄存器的地址
***********************************************/
#define  		ADDR_RXBUFF         					0x0000
#define  		ADDR_TXBUFF         					0x0001
#define			ADDR_RXD_DATA_VALID_STATUS				0x0002
#define			ADDR_BaudRate_Config					0x0003
